[
  {
    "name": "《网络是怎样连接的》",
    "rate": "9.5",
    "writer": "［日］户根勤",
    "content": "入门网络的最佳书籍，简单易懂，一窥网络全貌。数据如何从网络一端到另一端，经过哪些软件、硬件，写得清清楚楚。这让我习得了一种学习计算机科学的方法，那就是<b>从数据的流向来学习</b>，观察数据如何变化能更好的理解某些方法、库的设计原理。 其实这也是计算机的本质，即输入->输出。\n一图胜千言：当然，国内已经没有‘电话局’，主要是三大运营商。作为软件开发人员，重点放在网络应用程序、TCP/IP、数据包、缓存服务器、防火墙等。而数据如何在网线、城市/国家之间传输，我们可以简单了解。",
    "date": "2024-07-10 10:51",
    "fullImg": "https://raw.githubusercontent.com/iHongRen/iHongRen.github.io/master/screenshots/reading/network.png"
  },
  {
    "name": "《麦肯锡不外流的简报格式与说服技巧》",
    "rate": "",
    "writer": "〔日〕高杉尚孝",
    "content": "很实用的技巧，各个小细节都考虑在内，关键点在于说服。\n演示的目的是促使对方发生特定变化，采取特定的行动。从“不知道”到“理解”，从“反对”到“赞成”，从“怀疑”到“信任”，从“敌意”到“善意”，从“气馁”到“充满希望”……在演示中我们常常忽略的一点是：对方的认知是否能够我们演示的内容理解。",
    "date": "2018-12-31 01:18"
  },
  {
    "name": "《麦肯锡问题解决方法与技巧》",
    "rate": "",
    "writer": "大岛祥誉",
    "content": "通过\n金字塔图\n3C\n4P\n7S\n逻辑树\n问题树\n空雨伞\n定位矩阵\n商业系统\nMECE 不重复不遗漏\n清古堂 破产 点心",
    "date": "2018-12-22 21:46"
  },
  {
    "name": "《蔡康永的说话之道2》",
    "rate": "",
    "writer": "蔡康永",
    "content": "这本的兔斯基没有那么多的自我加戏了。今年有一个很大的改变就是不在排斥此类书籍，反而更愿意去改变了。我已经感受到能把话说好的重要性，以前单纯的关注技术，这是片面偏激的。\n\n本书的核心说话之道，就是“对你好”；因为我说得让你开心，你也会把我放在你心上。",
    "date": "2018-12-21 21:48"
  },
  {
    "name": "《蔡康永的说话之道》",
    "rate": "",
    "writer": "蔡康永",
    "content": "九方文轩Books果然是看书的好地方，一坐下来就立马阅读进入状态。上个月才开始看《奇葩说5》，辩手们的口才叹为观止。而说话温雅的蔡康永也让我印象深刻。马东评价他说话“恶毒”，恶是角度，毒是精确。我觉得这个评价很精准。\n\n透过说话，懂得把别人放在心上，这是我相信的、蔡康永的说话之道。40篇小故事，很快就看完了。深知自己不会说话，将会在以后尝试着说话之道。",
    "date": "2018-12-21 21:39"
  },
  {
    "name": "《跃迁》",
    "rate": "",
    "writer": "古典",
    "content": "这本书知识点太多，需要多次翻阅。由于经常听逻辑思维“得到”的关系，在看本书时很多地方都觉得似曾相识。尽管如此，在通读一遍之后，整个人都感觉很通爽，认知的台阶又上了一级。我决定好好利用此书，到时再来好好写写。",
    "date": "2018-12-21 21:25"
  },
  {
    "name": "《斜杠青年》",
    "rate": "",
    "writer": "Susan Kuang",
    "content": "斜杠青年提倡的：多重身份和多重收入是一种主动寻求乐趣、让自己生活得更快乐的方式，因为它能让我们在保留一份能够给自己提供稳定收入的同时，去寻求、探索以及尝试不一样的事情，从而找到人生的动力与激情。\n\n工作是人生必不可少的一部分，但上班不是。\n\n利己主义是新时代的美德。亚当斯密最大的贡献之一在于，他把人类从赚钱以及利己的罪恶感当中释放出来，让人们在利己心的支配下努力劳动，为别人提供想要东西的同时也获得自己想要的东西，整个世界经济也因此得到突飞猛进的发展。\n\n一千个铁杆粉丝理论：任何创作者，只需要拥有一千名铁杆粉丝便能养活自己。对于那些想通过做自己喜欢的事情来获得经济独立，或者不打算依赖他人投资的独立创作者来说十分有意义。\n\n关于幸福，因为它和主观意识相关，所以我们得不到一个确切的定义。然而，对于什么是不幸福，人类在认知上确惊人的一致。那么如果从正面无法解决幸福的问题，何不从幸福的反面下手呢？因此我们的目标不是去寻求外在的刺激以获得快乐，而是尽最大可能摆脱痛苦。",
    "date": "2018-12-21 21:05"
  },
  {
    "name": "《Web全栈工程师的自我修养》",
    "rate": "",
    "writer": "余果",
    "content": "五年前刚毕业，我在博客的副标题上写着：励志要成为一名伪全栈工程师。如今我能写App、小程序、网页，而后端知识却知之甚少，几次想进入后端领域都未成功。看完此书，又燃起我对于全栈的热情与渴望。\n\n要做一个全栈工程师，作者给出了两条建议，我非常赞同。\n一、技术服务于商业目标。老板雇佣一个员工，不是因为他能写程序，而是因为他能帮助自己赚钱。\n二、关注用户体验。所有你为之服务的人都是你的用户，不仅仅是产品用户。如果你在做PPT演讲，观众就是你的用户；如果你要汇报工作，老板就是你的用户；站在用户的角度想问题。",
    "date": "2018-12-21 20:37"
  },
  {
    "name": "《麦肯锡精英的思考习惯》精英如何对待工作？",
    "rate": "",
    "writer": "〔日〕高杉尚孝",
    "content": "工作中，会有挑战、责备、委屈、失败等各种遭遇而拥有强大的内心本身就是一种优势。本书提倡增强心理韧性，将“必须绝对”错误的思维方式转化到“相对愿望”正确的思维方式。\n\n所谓性格，可以说指的是思维、情绪、行为模式。\n\n我在想，如果必须要求达到某个位置，那么我们可以距离该位置留出一点空间。在那里我们可以在停下来思考、调整心态、观望、储能、应急准备…，这是很好的做法。",
    "date": "2018-12-03 15:03"
  },
  {
    "name": "《麦肯锡精英的48个工作习惯》",
    "rate": "",
    "writer": "〔日〕户塚隆将",
    "content": "事无巨细，工作中的细节安排妥妥当当。刚入职的新人不知道如何做事的可以借鉴，公司老油条可以对比下自己做事是不是不够主动。",
    "date": "2018-11-16 13:54"
  },
  {
    "name": "《麦肯锡工作法》个人竞争力提升50%的7堂课",
    "rate": "",
    "writer": "〔日〕大岛祥誉",
    "content": "阅读时，由于作者都是以自己的工作作为导向，觉得讲得好有道理。\n读完总结时，才发现这些工作法大部分还是那些通用道理。\n\n要知道除了技术性的要素，一个人的人格魅力、工作态度以及思考方式等都是工作中的重要部分。\n\n1、问题驱动。\n2、不要依赖二手信息，自己应该亲临现场，亲自收集信息。\n3、在面临新工作、新挑战或新难题时，不恐慌的情绪本身就是优势。\n4、真正出色的人才具备一种艺术家的灵感。\n5、倘若大家现在正苦恼于周围人对自己的评价，我建议大家果断地摒弃该想法，专注于利用自己的独特优势创造价值。\n6、许多情况下，表面看来的问题实际上并非实际的问题所在。\n7、“空·雨·伞”的思考方式：“空”指的是事实，即现状如何；“雨”指的是意义，即这种现状意味着什么；而“伞”指的则是解决方案与对策，即从该意义推导出要做什么。\n8、至于如何突破自己的框架，我推荐一种较为简单的方法：有意识地改变自己的行为。\n9、尝试以学习的态度与对方交流。\n10、“留在”笔记本上并不是目的，“一边记录一边自我吸收”才是目的。\n11、自己身边的人、物、信息等都存在无限的可能性，持有这种中肯的观点，有利于开展零设想。\n12、工作中遇到不喜欢的人时，试图发现对方10个以上的优点与长处，将产生显著的效果。\n13、可以发现经营包含三个要素：如何进行判断的判断力、如何联结相关人员的沟通力以及如何付诸实践的执行力。\n14、在解决问题的时候，向人询问自己不知道的事情并不丢人，对自己不知道的疑问听之任之才更为可耻。\n15、如何才能变得善于深入思考？我认为，关键在于母语水平。基于此，我希望大家通过阅读经典名著，或者有意识地创造接触优美的母语的机会，增加常用词汇量。\n16、坚持锤炼感知某物的五感，思维自然也将更加清晰。",
    "date": "2018-11-12 18:05:56"
  },
  {
    "name": "《致敬变革者》",
    "rate": "",
    "writer": "网易团队",
    "content": "访谈了一批企业家，讲述了他们各自企业的成功之道。\n\n家居变革者荣麟的“不差异毋宁死”的企业哲学让人印象深刻，甚至还提出荣麟不是做家具的，而是一个创意企业。第一反应是家具界的苹果啊？\n\n对于创业和创新的看法：\n创业主要是看你给什么用户提供什么服务，这才是最核心的价值。至于是不是原创，可能并不重要。王兴说泰康保险创始人陈东升曾经提过一个观念——率先模仿也是创新。移动互联网初期很多idea都出自国外，但是有人就效仿过来了，才成就了如今中国繁荣的移动互联时代。\n\n远大集团董事长张跃似乎是个很有情怀的人，他说自己创业时属于极度贫穷的时代，那时的人们只想着发财致富。可如今物质满足已经很高了，应该把追求个人的财富放第二位，要追求人的意义。现在他更关注环保、健康、生存等问题，比如做整合社区，推广建筑保暖等方法。",
    "date": "2018-11-12 18:05:16"
  },
  {
    "name": "《当下的力量实践手册》",
    "rate": "",
    "writer": "〔德〕埃克哈特·托利",
    "content": "相对于主书来说，更简洁。看完后，等同于复习了一遍《当下的力量》。\n\n对于当下临在不错的比喻：\n在一个浓雾弥漫的夜晚，你一个人独自走在路上。但是你有一个光亮很强的手电筒，在浓雾中开辟了一个狭窄而明亮的空间。浓雾就是你的生活情境，它包含着过去和未来；手电就是你的意识临在；明亮的空间就是你的当下时刻。\n\n\n整理了一些感受当下力量的实践方法：\n1、每次你在家中或办公室上下楼梯时，你每一步、每一刻，甚至每一次呼吸时都全神贯注，完全集中你的注意力。\n2、当你洗手时，关注与洗手有关的所有感觉：水的声音和感觉、手的运动、肥皂的香味等等。\n3、在你上车时，关闭车门后，停顿几秒钟并观察你的呼吸。觉察那个宁静且强而有力的临在。\n4、多关注自己对各种人、事、物的反应，至少像你关注让你有反应的人或事情一样。\n5、请你在此刻找出你的问题，不是明天或10分钟后，而是现在就找出问题。\n6、请充分地利用你的感官。定静在原处，环顾四周，但只是看就好，不要去做任何的分析与解释。\n观察你呼吸的节奏，感觉空气的流入流出，感觉在你体内的生命能量。\n7、不要将注意力集中在未来需要做的一百件事情上，而要将注意力集中在此刻可以做的一件事情上。",
    "date": "2018-11-04 15:23:52"
  },
  {
    "name": "《当下的力量》",
    "rate": "",
    "writer": "〔德〕埃克哈特·托利",
    "content": "作者是相当的唯心啊！越写越玄。\n很早我就察觉到，自己的脑子里大多数时间都是在怀着过去，想着未来。这其实是犯了大忌，人本该是活在当下的，这里的当下就是此时此刻。\n作者要求我们停止当下的思维活动、思维认同，让我们从思维中解放出来。从而达到‘临在’状态，观察自己又不分析自己，完全地进入内在，注意力集中在身体的内在能量场上，从内在感受自己的身体。\n灵修，企图用生命科学来解释宗教。暂时，我大概是这样认为的。",
    "date": "2018-10-31 23:48:21"
  },
  {
    "name": "《English-level-up-tips-for-Chinese》",
    "rate": "",
    "writer": "byoungd",
    "content": "这本指南主要面向程序员和设计师：\nhttps://github.com/byoungd/English-level-up-tips-for-Chinese\n\n看过太多英语学习技巧，大同小异，Get到的点不多。倒是背单词周期的重复，我联想到了可以斐波那契数列式重复。也许数学理论同样适用于人类大脑记忆呢？",
    "date": "2018-10-31 23:47:45"
  },
  {
    "name": "《给初学者的绘画手册》",
    "rate": "",
    "writer": "〔美〕多萝西·福尼斯",
    "content": "读本书有一种在看视频教学的感觉。\n\n年初立了个学画画的 flag , 吹出去的东西，还是要想办法圆一圆。不然有好事者提起，那就尴尬了。\n\n作为门外汉，先找出一些关键词：\n褶纹、阴影、轮廓、质感、颜色、握笔、形状、边线、突出、细线、弧度、厚度、尺寸、半光、形态、主色调、协调、平衡感。\n\n 一个素描本，一支铅笔，一张纸和一把小刀，这就是开始绘画时所需的全部用品。",
    "date": "2018-09-16 22:23:53"
  },
  {
    "name": "《学习之道》",
    "rate": "",
    "writer": "〔美〕芭芭拉·奥克利",
    "content": "即使之前看过很多有关学习的书籍，本书给出的点也值得去实践。\n\n学习有两种模式：\n一种是“输入—练习—内化—输出”，另一种“理解范式—应用范式—识别范式—输出范式”。\n\n学习方法两类路线：\n一类走的是学院派路线，主要是梳理学习心理学中的各种理论。另一类走的是实践派路线，作者往往靠个人的天赋和努力，摸索出了一些基于经验的学习方法。\n\n很好的诠释了专注模式和发散模式之间的区别：\n想象从手电筒里打出来的光。专注模式下的光束更紧密，穿透力更强，径直打在一小块区域上。而如果你拨到发散模式，光柱会分散开，照亮的范围更广，但各处的光强都会降低。\n\n如果你想要理解新事物，那最好关掉精确的专注思考模式，把开关切换到“广角光源。\n\n相比纯粹的重复阅读，回想才是学习过程中最好的刻意练习方式。（本书的一大重点就是运用回想）\n\n提取练习是最强效的学习方式之一。\n\n可以试着创造一种便于记忆的视觉图像来代替你想要记住的关键条目。\n\n 知识拟人化：\n爱因斯坦想象自己是一个以光速移动的光子，然后想象第二个光子会怎样看他，第二个光子会看到并感受到什么呢？\n\n学习新东西的难度和你去认识新人物比起来差不多。他们都有独特的个性。你越了解他们的性格，就越能读懂他们。\n\n有一题没有看出来。\n如何只移动三个硬币，组成一个新的朝下的三角形？",
    "imgs": [
      "https://raw.githubusercontent.com/iHongRen/iHongRen.github.io/master/screenshots/reading/coins.jpeg"
    ],
    "date": "2018-09-10 23:12:34"
  },
  {
    "name": "《增长黑客》",
    "rate": "",
    "writer": "范冰",
    "content": "数十个小案例，鬼点子特别多，值得借鉴学习。结合我们自身产品，找出增长点。\n\n这是一群以数据驱动营销、以市场指导产品、通过技术化手段实现增长目标的人。\n\n他们通常既了解技术，又深谙用户心理，擅长发挥创意、绕过限制，通过低成本的手段解决初创公司产品早期的增长问题。\n\n增长黑客的价值正是通过不断地“头脑风暴-排定优先级-测试-分析-常态化部署”来优化产品策略。",
    "date": "2018-09-05 22:05:11"
  },
  {
    "name": "《象棋的故事》",
    "rate": "",
    "writer": "茨威格",
    "content": "茨威格的文字是真的有力量。\n好傲气凌人的话语：“我是谁，你们都知道，至于你们是些什么人，我不感兴趣。”\n\n每每读完一个故事都可以套上文中那句话：在这麻木迟钝、毫无欢乐的时代，我又一次生动地感觉到了纯真的激情，一种心灵里充满阳光、完全献身于艺术的心醉神迷——对于这种精神状态我们这些人似乎早已忘怀了。\n\n一个思想活跃的人竟一辈子把自己的世界仅仅局限在黑白方格之间狭窄的单行轨上，只在三十二颗棋子前后左右的挪动中寻找成功的喜悦，一个人开局先走马而不走卒竟是件了不起的大事，能在棋谱的某个不起眼的地方提到一笔就意味着不朽。\n\n一个人，一个会思想的人，十年，二十年，三十年，四十年如一日，将自己思想的全部张力一次又一次可笑地用在把木头棋子“王”逼到木制棋盘上的角落里去，而自己竟没有发狂！",
    "date": "2018-08-31 23:13:00"
  },
  {
    "name": "《毛姆读书随笔》",
    "rate": "",
    "writer": "",
    "content": "最聪明的人应该是这样的：他们发现了最大最长久的满足是汲取知识。想要不断受益的人，可以把阅读当成一种习惯。很少有什么运动可以带来持续的满足感，这种满足感一般在我们年富力强的时候就已经结束了。\n\n画家脑海中常会出现某一处景致：一条河道弯弯曲曲不断蔓延；或是一条嵌在雪地里同时又夹在无边落木之中的路。这些景致会在他内心引发无来由的激情，不要问为什么，画家自己也不知道，他们只知道自己眼前堆满了素材，突然拥有了无限的创作欲望。\n\n创作天赋本就是一种非常奇妙的东西，它只钟情于年轻人，而且会随着年纪的增长而逐渐减少；这是非常自然的，因为经历是它生长的土壤，多数人会随着年纪的增长，生命中的经历便不再新鲜、惊险和刺激，例如作家的创作欲望往往都是青年时代的经历所激发出来的。\n\n就读者而言，最重要的是自身对一本书的认识，就算世界上所有人都不赞同你的观点又有什么关系呢？因为你的观点只会让你自己受益。\n\n千万不要觉得对我影响深远的书籍对你也同样影响深远。要是你这样以为，就太说不过去了。\n\n知道略读重要性的人，才能明白怎样享受阅读，同时又获得不小的收获。\n\n我们有多少次迫使自己与那些跟自己只有血缘关系却没有其他共同之处的人尝试着进行交流？\n\n‘他的圈子里没有朋友，只有关系很近的熟人。’ 这句话倒是挺符合我的。毛姆的读书笔记有自己大量的思考和总结，而我的基本是划线摘抄，懒到不想动脑。",
    "date": "2018-08-26 22:47:13"
  },
  {
    "name": "《人生的意义》",
    "rate": "",
    "writer": "〔英〕特里·伊格尔顿",
    "content": "有点读不懂，总觉得作者从小说和诗歌里解读出来的那些理论难以让人信服。\n人生的意义的两大选项——爱和幸福。\n\n自我是一个去中心化的网络，而不是神秘难解的精神。（扁平化自己）\n悬崖间走钢丝”的人生理论：你稍微思考一下，幸福感立刻就坠入谷底。\n哲学家有一个惹人讨厌的习惯：喜欢分析问题，而不是解答问题。\n\n想起胡适在《一个问题》写的：\n朱子平问小山：人生在世，究竟是为什么的？\n小山回答：子平，这个问题是没有答案的。现在的人最怕的是有人问他这个问题。得意的人听着这个问题就要扫兴，不得意的人想着这个问题就要发狂。他们是聪明人，不愿意扫兴，更不愿意发狂。\n我一直不明白的是得意的人为何会扫兴？？",
    "date": "2018-08-11 23:26:52"
  },
  {
    "name": "《淘宝技术这十年》",
    "rate": "",
    "writer": "子柳",
    "content": "主要是2003~2013这十年的淘宝后端技术，可以说是数据量推动了淘宝技术的不断进步，从使用技术到创造技术。都是围绕着分布式、高性能、缓存、存储、成本等方向突破。\n\n好的架构、功能是进化来的，不是设计来的。\n从PHP更换到Java时， 淘宝直接请了Sun公司的人来主刀。把支付宝从淘宝分出来的，就是Sun的这几个人。\n淘宝员工的花名倒是很有意思。淘宝的第一个程序员多隆，“扫地僧”级别，“有困难，找多隆”。",
    "date": "2018-06-20 23:03:39"
  },
  {
    "name": "《Effective Objecttive-C 2.0》",
    "rate": "",
    "writer": "",
    "content": "编写高质量iOS与OS X代码的52个有效方法\n好书，真正做到了言简意赅，深入浅出。做了多年iOS，也能从中擦缺补漏，很多模糊的小点逐渐变得清晰，心里也舒畅许多啊！\n回忆起多年前入门iOS开发时，第一本书《Objective-C基础教程》也是相当的好，确实是能让你想看下去，能带你进门的书籍。\n特此新开一个repo记录开发过程中遇到的小Tips（iOS-Dev-Tips）。",
    "date": "2018-06-09 10:53:00"
  },
  {
    "name": "《JavaScript语言精粹》",
    "rate": "",
    "writer": "",
    "content": "首次接触铁路图，用于描述语法很适合。\n优美特性：函数是顶级对象、基于原型继承、动态对象、字面量…\n毒瘤：全局变量、自动插分号、typeof、parseInt、假值…\n糟粕：==、with语句、eval、++--、new、void…\n\n继承相关还有点模糊，有待加强理解。",
    "date": "2018-06-02 11:17:00"
  },
  {
    "name": "《古都》",
    "rate": "",
    "writer": "川端康成",
    "content": "千重子是一个很会触景生情的女生，总带着一点淡淡的哀伤。有着友爱的一家人，一个双胞胎姐妹，几个钦慕她的男子。借助她的眼，可以看到这个古色古香的京都风貌，京都人的生活，京都的花花草草，山清水秀，风土人情，繁文缛节…。虽然没去过日本，但是在网上看到京都那保存完好上千年的古建筑群，喜欢人文历史的我，也会心神向往。\n\n连续看了两周川端康成作品，告一段落。总得说来，他的作品文笔美，叙事淡，总抓不到主题。",
    "date": "2018-05-27 16:35:17"
  },
  {
    "name": "《名人·舞姬》",
    "rate": "",
    "writer": "川端康成",
    "content": "《名人》\n纪实小说，本因坊秀哉名人人生的最后一战。这场持续三个月的围棋对弈(名人VS大竹七段)，以名人战败而告终。同时也标志着明治时代传统围棋的终结。作者以观战记者的身份记录了整个过程，与其说是在观棋，不如说是在观察下棋的人。\n虽然小时候接触过围棋，中午放学的两小时总要下两局，但是书中出现的很多术语还是很陌生。还记得《围棋少年》和《棋魂》都是我的最爱。围棋少年，历经磨难，江流儿，佐为，从未忘记这些人物。\n\n《舞姬》\n作者还真是多才多艺，对芭蕾舞了解也颇深，还有大量佛家知识。\n人到中年，不知为何找外遇的那么多，家庭伦理总是让人不得安宁。\n二十年多来，波子感觉自己有好几个身躯，一个同失木一起生活，一个在跳舞，另一个又在想着情人。一直想成为一个人，把自己的好几个身躯统一成为一个人。\n战时，纵令国破山河碎，家庭也没有崩溃。\n战后，在平凡的生活中整个家庭已是貌合神离，分崩离析了。\n入佛界易，进魔界难。",
    "date": "2018-05-26 23:59:07"
  },
  {
    "name": "《伊豆的舞女》+《雪国》",
    "rate": "",
    "writer": "川端康成",
    "content": "《伊豆的舞女》\n在情窦初开的年纪，一次旅行的邂逅是那么的美妙。偶尔的偷看，被看到后的垂面红晕，又是那么的可爱。共爬一小山，共赏一片景，很多时候旅途中相识的人最让我们印象深刻。\n\n《雪国》诺奖提名三部小说之一\n写得平淡而虚无、人物之间交谈琐事几乎不带任何夸张的情绪，交相辉映着乡村雪景，画面显得很安详。很容易让人联想到《情书》中的皑皑白雪。再加上温泉上腾的水雾，唯美极了。\n也反应了底层女性对生存的渴望，对爱情的奢求。\n作者落笔即是美景。红叶落尽，窗外飘来纷扬的雪花，美如画。",
    "date": "2018-05-25 23:03:18"
  },
  {
    "name": "《爱你就像爱生命》",
    "rate": "8",
    "writer": "",
    "content": "总有一种窥看别人日记之感。\n好多年前的寒冬，每晚我都写睡前日记，主题是罪己和爱人。开学后把它送人了，再归到我手上时，被我无情的撕毁。如今想来，什么自我，任性之词还真是我的标签。日记内容不记得了，唯有那寒夜里，刺骨的冷油然于心。\n\n有一路人不喜欢“学以致用”这个说法，当年欧几里德的学生问他：几何学能带来什么好处？欧几里德就叫人给他一块钱，打发他滚蛋了。我也开始不喜欢这个词了。\n人是轻易不能知道自己的，因为人的感官全是向外的，比方说人能看见别人，却不能看见自己；人可以对别人有最细微的感觉，对自己就迟钝得多。\n把真正美好的东西当成自己的财富。\n内心的虔敬是种未曾得到满足的受虐狂想。",
    "date": "2018-05-13 22:56:47"
  },
  {
    "name": "《黄金时代》",
    "rate": "8",
    "writer": "",
    "content": "文革时生活很荒诞，但记忆却很深刻。\n上山下乡时，我爷爷是本地一队长，我家先后来了好几批知青插队。四五十年过去了，有两批知青与我家还有着联系。那时候我爸也还小，经常被一些小孩欺负，一知青就帮我爸爸欺负回来。队里唯一的拖拉机总是被主任的儿子霸占着开，一知青老看不惯，有一天趁着拖拉机空闲，他直接开着回城里家呆了一天。这些都是那位知青亲口回忆，还有很多革命时期的生活。生活还是生活，有人欢笑有人痴笑，都在继续着…。\n\n对于文革：挨打的不知为何挨打，打人的不知为何打人。\n对于知青：吃尽千辛万苦，做一件傻事。\n\n有一个生活主题，一直魂牵梦绕着本书，那就是性。这也是几个主人公对抗世俗的一大利器。关于性，虽然是美好的，但于公众面前保持其神秘感更好。好比衣服，“犹抱琵琶半遮面”时美感最佳。出门时穿衣服，他人舒服；而上床睡觉最好时脱衣服，自己舒服。",
    "date": "2018-05-06 20:49:23"
  },
  {
    "name": "《黑铁时代》",
    "rate": "8",
    "writer": "",
    "content": "故事比较杂，文字有点乱。\n恰好我们正处在黑铁时代，住在黑铁公寓里(价格也很黑)，这里不是监狱，却人人都戴着黑色枷锁。似乎此锁越贵重越坚固，就表明你的社会地位越高，能有把好锁就是值得骄傲的。我们作为货物，想要卖个好价钱，就得看能交多少房租。\n隐约感觉自己被戴上了把黑锁。甚至还自己去买锁来戴。一戴就是好几年，还越戴越舒服，我这是怎么了？\n\n无双在哪里？无双是不是存在？我现在是不是在做梦？我只知道自己一无所知。——《王仙客寻无双记》\n\n不要和爱慕虚荣的人过不去，理论上他们并没有做什么坏事。",
    "date": "2018-04-29 12:02:20"
  },
  {
    "name": "《自控力：如何掌控自己的时间和生活》",
    "rate": "7",
    "writer": "",
    "content": "一些自控力训练方法倒是有意思，还有一些观念与种庄稼类似。\n将全部思想集中在一个物体上，从不同纬度去看它，去发现它的不同。\n将全部注意力集中在听力上，数一下能听出周围有几种不同的声音。",
    "date": "2018-04-22 21:13:24"
  },
  {
    "name": "《跟任何人都聊得来》",
    "rate": "8",
    "writer": "",
    "content": "看此类书的多半是内向者。作者说自己本是一个内向者，这倒是迎合了我等。\n\n重要谈话可做笔记，让人感觉真正在意对方。提前到场，熟悉环境，做好准备。观察并了解交谈中的所有人，包括你自己。保持好奇心，明确交谈目的，对整体概况有清晰认识。记住对方兴趣爱好，交谈中重复对方名字。交谈结束做个简短总结发言，说一下收获。\n\n沟通的目的在于理解他人，而非改变他人思想。\n有效的目光接触可被视为“精神的握手”。\n从内容提供者转变为内容拓展者。\n沟通中的最大资源：对方的人生阅历和思维观点。\n\n于我而言，沟通的最大障碍在于不自信。",
    "date": "2018-04-18 18:06:33"
  },
  {
    "name": "《蛙》",
    "rate": "8.5",
    "writer": "",
    "content": "是蛙更是娃，也是娲。整就是一个生娃造人的故事。五十余年的往事回首，山河巨变下，从接生到绝生，乃至代生。鲜明的人物，让我分不清这是真实记录还是虚构创造。不知看完故事的你是否有想要孩子的冲动？\n\n一个奇葩的乡村，全村人起的名字都会带一个身体部位，如陈鼻，万足，肖下唇…。\n以前觉得文革中被迫害的那帮人很惨，现在看来有一批人忍辱负重后，后来的日子过得很滋润。\n一个国家的经济命脉真的是由制度决定。\n突然让我想到了前段时间非常火的一款手游《青蛙旅行》，他们传达的思想也很像。",
    "date": "2018-04-18 18:03:28"
  },
  {
    "name": "《腾讯传》",
    "rate": "8",
    "writer": "",
    "content": "相当愉快顺畅的阅读完。\n今年是腾讯第20个年头，从使用电脑开始，它的产品至今仍是在最高频率的使用，我伴随着它长大，它也伴随着我长大。它离我们是那么近，又是那么的远。早年的各种棋牌，后来迷上的网游，以及一直未离开过的QQ。当这些与书中的内容对应上时，不免开始回忆青春来。那是在网吧里战火燃烧，决胜千里的岁月。\n\n本书就如腾讯公司一样，由一个一个产品堆积而成。展现给我们的都是熟知的外在东西，腾讯的内在还是隐藏起来的。也许是腾讯几位创始人都是低调性格才把这家公司一直包裹得很好。 \n\n何时创业都不要觉得晚，很多行业都存在巨大的不确定性，每隔几年都拼杀出来的独角兽即可证明。\n\n我们不仅要思考什么是对的，更要想想什么是能被认同的。\n不要告诉我世界是怎样的，告诉我如何创造世界。\n包容这三种真实：事实真实、逻辑真实、情绪真实。",
    "date": "2018-04-14 22:27:30"
  },
  {
    "name": "《人间失格》",
    "rate": "8.5",
    "writer": "",
    "content": "十几二十岁的我，也有过轻生的念头，但和太宰这类人是不一样的，通常我是遇太委屈之事，越想越委屈才会突然冒出此类想法。而他是又一个芥川龙之介，生来就只能看到地狱，从不相信有天堂，相信人之初，性本恶，从一开始就小心翼翼隐藏着这个恶。当恶被人发现察觉，会觉得是活在炼狱之中。当这个恶全部释放，暴露在所有人面前，就是真正的活在地狱之时。当你凝望深渊时，深渊也在凝望着你，最后你还不得不跳进那深渊，结束可耻的一生。\n\n阅读时心中响起五月天的《你不是真正的快乐》：\n你只想变成透明的颜色\n你的笑只是你的保护色\n把你的灵魂关上永远锁上躯壳\n当生存是规则，不是你的选择\n密密麻麻深深浅浅的刀割\n你的伤不肯完全的愈合\n…\n\n所谓世人，也就是人的复数，有时不过是在意的那个人。\n\n席勒的《地球的分配》故事贼好， 学生们请牢记你们原本的面貌，你们是神的宠儿，为这特权骄傲，务必珍惜这身份，你们今生与神同行的时光仅此一段。\n\n提防中产阶级危机，不为面子而活。\n\n作家可是高危职业\n国内的：王国维、三毛、傅雷、海子…\n日本：芥川龙之介、太宰治、川端康成、三岛由纪夫…\n西方：海明威、茨威格、莫泊桑…",
    "date": "2018-04-11 22:31:51"
  },
  {
    "name": "《非暴力沟通》",
    "rate": "8",
    "writer": "",
    "content": "中医有望闻问切，而非暴力沟通有观感需请。不带评论的眼光，不用强制的命令，不回避责任。\n书中说改变沟通方式是自我转变的开端，但看了本书我还是觉得自己不会有什么大改善。总觉得中国人说出那些话，显得很虚，很不自然，中西方语言文化差异决定了。\n\n摘：\n道德与不道德的区分之外，有片田野。我将在那里见你。\n如果真的想过上悲惨生活，就去与他人做比较。",
    "date": "2018-04-07 23:00:32"
  },
  {
    "name": "《小王子》",
    "rate": "9.5",
    "writer": "",
    "content": "近些年，发现自己不爱思考了，稍微遇到瓶颈，就急迫的想知道答案，有时连太长的问题都没耐心看完。我成大人了，光用眼去看问题，完全没用心。我就像“点灯人”，一直工作，一直睡觉，都是别人安排好的，也没管到底是不是自己想要的，没头没脑的一直执行着。\n\n如何才能找回丢失的纯真？",
    "date": "2018-03-26 22:17:58"
  },
  {
    "name": "《寂静的春天》",
    "rate": "7",
    "writer": "",
    "content": "50多年前的环保书，可能有点老了。如果是在今天，这就不该是厚厚的一本书，而是各种数据图表或视频，这样更直观，传播也更广。\n\n杀虫剂开启了潘多拉的盒子，化学有毒物质从害虫、植被传到飞禽走兽，甚至人类，乃至子孙后代，一条绝命的毒化链就此形成。解决办法就是“生物防治法”代替“化学控制法”，一种以夷治夷的策略。\n\n环境问题一直在，文中描述的毒物时代同样也还在，近几年的雾霾更是爆表。在相信科技、相信国家的同时，作为人类一份子也要提升自身的环保意识。",
    "date": "2018-03-19 22:24:02"
  },
  {
    "name": "《如何变得有思想》",
    "rate": "8.5",
    "writer": "",
    "content": "基本上就是作者的读书笔记，书单感觉很不错，有几本还是看过的。在嘈杂的网络环境中，能拥有自己独立的思想领地是多么的幸福。作者坚持写了10几年的个人博客，让人钦佩。\n\n首先思想就是观点，观点可细分为四部分：\n事实：也就是客观的存在，如“太阳从东方升起”。\n前提：做出推断的依据，如“两点之间直线最短”。\n逻辑：做出推理的规则。\n结论：最后得到的观点。\n\n那么如何变得有思想呢？无非也是在这几个方面加强努力：了解更多的背景知识，明确个人的价值观，培养自己的逻辑分析能力。\n\n人必须先说很多话，然后才是保持静默。",
    "date": "2018-03-17 23:57:15"
  },
  {
    "name": "《知更鸟女孩》",
    "rate": "8",
    "writer": "",
    "content": "一部公路小说，带有电影剧本的风格，整体格调比较阴郁黑暗。情节急促，人物出口成脏，其中常带无厘诙谐，暴力肆虐，两杀手让我想到了电影《低俗小说》。\n可正如小说中女主角说的：故事真精彩，可你的重点在哪里？\n或许想说的是小说中一直重复的那句话：该是什么就是什么。\n又或许是要表达：天平必须保持平衡。如果你想改变，而且是巨大的改变，一个改写生死、令命运屈服的改变，就势必要付出一定的代价——“血的代价”。\n然而故事就是故事，懒得去揣测作者心思，毕竟本书后面还有好几部。",
    "date": "2018-03-14 09:02:06"
  },
  {
    "name": "《价格游戏》",
    "rate": "9",
    "writer": "",
    "content": "很喜欢本书的构思，虚拟出巧克力茶壶公司，从一个产品概念到价值20亿英镑，一步一步的解说有关产品定价的相关内容。如小说般流畅，又一本正经的用专业知识解决价格问题。\n\n生活中存在着各种小规律，人身在也存在着许多普遍心理。如果能巧妙的应用到你需要的场景中去，它们就能产生的奇效。去收集、去发现、去留心，接下来就是见证奇迹的时刻。",
    "date": "2018-03-10 12:31:33"
  },
  {
    "name": "《小说故事.姊妹篇》",
    "rate": "8",
    "writer": "",
    "content": "两篇小说的主角却是小说。\n\n说部之乱：有一天，人类会被小说控制，世界将因此而崩塌，人的意识都被小说侵入并占据，会不自主的说出某部小说中的句子。最终精神恍惚，不再有清醒自觉的时刻，处于一种梦游状态。这种疾病被命名为“罗曼司症”。要想拯救人类，平息这场小说引起的变乱，就得再次讲述“加一道锁或封皮”的故事。\n\n原路追踪：在这个世界，唯一能让你变强的方法，就是阅读文学作品，具体说就是小说、散文、诗歌，你读到的文学作品越多越好，你的战斗力就越强，你获胜的几率就越高。决定刀客战斗力的不是身体，不是招式，而是小说阅读量。刀客只能在路上，在路上追踪其他刀客，之后展开生死搏杀，得到对方的书籍.直到尽头。",
    "date": "2018-03-03 18:36:02"
  },
  {
    "name": "《叔本华心灵咒语》",
    "rate": "8",
    "writer": "",
    "content": "214条有思想的大道理堆在了一起，反而显得没有那么精彩了。\n\n学习时应该遵循直观知识先于概念知识的顺序。\n尽信书不如无书。\n观察他人的人总是在努力塑造自身。\n一个人的风格应与他的思想本质是一致的。",
    "date": "2018-02-28 17:14:44"
  },
  {
    "name": "《软件故事》",
    "rate": "8",
    "writer": "",
    "content": "十分感谢几十年前老前辈们开创了计算机软件行业，让现在生活如此多彩。\n写下几行代码，瞬间就能改变亿万人的生活，这就是软件。用逻辑的方式重新描述与世界有关的事实。\n\n我们所从事的90%~95%都是工程工作，而非不朽的创新工作。90%的程序员都是技术水平一般的普通人。\n\n“我真正的天赋是很好地将技术与交流结合起来。”——林纳斯\n 好的程序员既擅长概念性思考，又善于把握程序细节；从高级语言设计到贴近机器底层的实施，转换自如。\n\n-小即是美\n-所见即所得\n-借鉴和创新恰到好处\n-创新就是反复尝试的过程\n-码农之乐，尽在一个‘码’字\n-工具方法背后的理念是每个部件都要足够简单\n-正确的工具，正确的时机，确立正确的生态地位",
    "date": "2018-02-24 22:58:19"
  },
  {
    "name": "《产品经理方法论》",
    "rate": "6.5",
    "writer": "",
    "content": "购买的产品经理套书中的最后一本，这套书我的评分普遍不高，阅读来也不带劲。本书像模板书，换个名字，改改关键词又是一本书。\n\n笔记：\n平衡三环：用户体验、企业需求和技术。也就是如何去搞定这三方人员。\n六字真言：刚需、痛点、高频。\n\n产品经理\n必要技能：沟通、项目管理、分析，以及对技术的理解。\n职责：提供情境、观点和愿景。\n实际上是在管理人，而不是产品。\n\n怎样取悦你的用户？——基本因素、期望因素、魅力因素。\n情境领导理念：搞清楚每个成员身处哪个学习阶段，相应地调整管理方式\n不同的学习阶段：\n1. 不知道自己不知道\n2. 知道自己不知道\n3. 知道自己知道\n4. 不知道自己知道\n\n- 危机（crisis）的字面意思是“转折点”——也可能是一个伪装的机会\n- 必须现在做的事，理想的话昨天就应该做了。",
    "date": "2018-02-13 17:28:32"
  },
  {
    "name": "《月亮和六便士》",
    "rate": "8.5",
    "writer": "",
    "content": "能做出诡异行为和有着天开想法的人，不是天才就是精神病。然而，我们大多数都不是这两者，还是不要去模仿他们了，苦了自己不说，还会伤害到周围社会。当然，如果你非要那么做，和我又有两便士关系？\n\n人们常常发现，离任的总理原来只是个能言善辩的口舌之士，卸职的将军也无非是个软弱可欺的市井之徒。",
    "date": "2018-02-08 22:32:49"
  },
  {
    "name": "《用户体验方法论》",
    "rate": "6",
    "writer": "",
    "content": "什么叫体验？超出用户预期的才叫体验。\n用户体验的核心使命是让用户获得超预期的数字体验，产品体验贯穿在用户使用产品的全过程。\n\n很多技术人员在做产品中犯的一个共同错误，太想把自己喜欢的技术展现给用户，把炫酷的技术概念介绍给用户，这就是忘了从用户角度出发。\n\n当你将设计好的作品递交给审核者，又不想让他们对你的作品指指点点，那么你可以在作品中故意安插一些明显的错误，让审核者的目光只关注那些错误部分，从而保留了你的精华部分。这个叫做“第六根手指”。\n\n飞行乘客经常投诉在等行李上浪费很多时间，乘客从舷桥走到行李提取处的平均时间为2分钟，等行李时间平均为8分钟。于是咨询师向机场建议将舷桥放的再远些，这样一来，乘客从舷桥到行李提取处的时间就变成了8分钟，等行李的时间就仅有2分钟了。这一改进让顾客投诉量大幅度下降。",
    "date": "2018-02-03 14:58:05"
  },
  {
    "name": "《影响力》",
    "rate": "9",
    "writer": "",
    "content": "各行如隔山，当你在研究学习各个基础学科的时候，别人在研究你，随随便便一个小套路，就能把你弄的服服帖帖。研究‘人’同样也是一门学科，且在人类协作中相当有用，获利效果极佳。\n\nTip:\n1、有自杀事件上新闻，近期就减少出行。\n2、在人群中向人求救时，请指明要哪个行人来救你，如那个穿白色上衣的先生。\n3、每当我们意识到自己中了套儿、要被迫遵从一个并不想答应的要求时，最直接的解围方法就是——一语道破他们在干什么就行了。\n\n回忆关键词:\n行为机械化、对比原理、互惠原理、登门槛、个人承诺、抛低球、人格解体、多元无知、社会认同原理、罐头笑声、琼斯镇惨剧、一致性原理、光环效应、无穷链、百特惠、午宴术、逆反心理、稀缺原理…",
    "date": "2018-01-31 22:36:41"
  },
  {
    "name": "《胡適文選》",
    "rate": "9.5",
    "writer": "",
    "content": "从《南渡北归》开始才慢慢关注民国的那些知识分子，诸如陈寅恪、傅斯年、顾颉刚…他们身上有太多有价值的东西需要自己去挖掘。而胡适是我比较熟悉的一位。这本文选直接表达了很多他的思想，存疑主义、科学的人生观、大胆假设小心求证…。发现很多文章都是在民国七八年发表的，也就是说那时的胡适和现在的我一般年纪，二十七八岁。然而我们的思想差距远如孙悟空一个跟斗。\n\n胡适四条建设新文学的意见：\n1、要有话说，方才说话；\n2、有什么话，说什么话；话怎么说，就怎么说。\n3、要说我自己的话，別说別人的话。\n4、是什么时代的人，说什么时代的话。",
    "date": "2018-01-24 23:16:14"
  },
  {
    "name": "《ECMAScript6 入门》",
    "rate": "",
    "writer": "",
    "content": "继续学习js，ES6引入了许多新特性，诸如：Proxy、Iterator、Promise...，Class使得其更加像面向对象语言了，同时还加入了模块体系Module。",
    "date": "2018-01-20 21:00:49"
  },
  {
    "name": "《JavaScript 标准参考教程(alpha) 》",
    "rate": "",
    "writer": "",
    "content": "阮一峰作品，虽然本书尚未完结，但对于前端小白仍及其受用，让我简单快速的浏览了一遍 JavaScript 的世界。",
    "date": "2018-01-14 22:46:53"
  },
  {
    "name": "《设计的方法》",
    "rate": "7",
    "writer": "",
    "content": "基本描述了一个设计作品，由与客户商谈需求到向客户演示提交设计作品的过程。可以说是面向客户设计了，一整个设计师流程，面面俱到，考虑得非常的细。导致语言太啰嗦，且没有我期待的设计内容，所有泛泛地扫读了。\n\n“设计方法”的几个阶段:\n1、发现阶段：通过观察和分析，收集数据，熟悉情境。\n2、规划阶段：确定关键需求与问题，开发策略，制作可行计划，以应对这些问题。\n3、创意阶段：探索概念性选择及潜在的设计指南，将这些可能性组织在一起，使其变得清晰化。\n4、应用阶段：实施“设计方法”，构建设计元素，同时进行试验、衡量、评估和修正。\n\n产生想法突破创意的几个方法：\n* 独立的头脑风暴和编辑想法\n* 选择最短路径\n* 尽量用最简单的方法解决问题\n* 改变你的环境\n* 时间表和最后期限会给你带来好处\n* 描述情境\n* 向同事讲述你面临的挑战\n* 设置一些限制\n* 引入随机元素\n* 重新开始 \n\n> “描述情境” 举例：\n> 填写这样的内容：我的客户是_______；他们经营_______；他们面临的难题是_______；我要通过_______来解决这个问题；它将会看起来像_______；它之所以看起来是这样的原因_______；它会让受众觉得_______；我会用以下的处理方式（_______，_______，_______）来让它得以实现；等等。",
    "date": "2018-01-08 22:01:20"
  },
  {
    "name": "《大师们的写作课》",
    "rate": "8.5",
    "writer": "",
    "content": "好文笔是读出来的，所有的写作，都是为了被阅读。\n阅读如饮食，食不厌精，脍不厌细，要尽你的物力、识力和心力来达成膳食的合理搭配、营养均衡。\n\n若以文字再造一个世界，无论写景状物、记事言情，都应该像设计师或电影导演那样孜孜于色彩的运用，精准，富于新鲜感、画面感和音乐感，以及像产品经理那样把提升用户体验当作重中之重。\n\n颜色搭配不再只是灰绿红蓝\n写风景最好有动态\n动词的活用\n从英文里学到一招：气势充沛的长句。\n文白间杂的写法，更能精确有力地传达出情绪\n四有文章：有趣、有用、有料、有力\n\n相较于被逻辑说服，人其实更容易被情感感染\n人们总是喜欢看情感充沛、酣畅淋漓的文章，平淡的东西不招人待见\n\n有学生向刘文典请教关于写文章有何高见，他吐出五个字：“观世音菩萨”——观是观察生活，世是明白世故人情，音是讲究音韵，菩萨是要有救苦救难关爱众生的菩萨心肠。\n\n你与那些轻轻松松就能有条不紊安排生活的人，相隔的只是番茄工作法、晨间日记、Do it软件以及一周三次跑步而已",
    "date": "2018-01-04 23:45:42"
  },
  {
    "name": "《人件》",
    "rate": "9",
    "writer": "",
    "content": "与《人月神话》共誉为软件管理图书领域的双子星。然而人件里的管理不是我认为的软件项目管理，它显得更大，处在更外一层，适用于大部分的脑力工作者工作管理，其中涉及：人力资源，工作环境，团队养成，会议社区…等等。一般管理者会觉得本书完全是在胡扯，完全是站在员工角度分析问题，为员工谋福利。\n\n一些关键词：\n项目社会学、高科技幻觉、自信的威胁、普适幸福感、有效流时间、团队自毁、黑衣团队、一顿意面晚餐、臭鼬工程、自由电子…\n\n管理者的作用不是让大家去工作，而是创造环境，让大家可以顺利开展工作。",
    "date": "2017-12-30 18:12:01"
  },
  {
    "name": "《布道之道》",
    "rate": "8",
    "writer": "",
    "content": "在为团队推广新技术和新工具的道路上，作为布道师的你，会遇到各种类型的怀疑论者。那么，如何说服这些人使用你的推广呢？ 在书里。\n\n技术不会驱动商业，商业只由商业驱动。\n当你凝视深渊时，深渊也在凝视你。",
    "date": "2017-12-28 23:55:02"
  },
  {
    "name": "《赢在设计》",
    "rate": "7",
    "writer": "",
    "content": "算是普及了一些网站营销统计指标。我还是一致的认为产品设计这东西，就是在研究用户心理。很多时候一个小小的改动就能带来可观的效益。\n从登录页、主页、分页、明细页、表单到最后的结算流程和用户行为分析，设计的要点最多出现的以下几条：\n简化流程\n突出要点\n提供帮助\n指示引导\n搜索过滤\n提供安全保障\n\n“搞什么，这些东西连一个四岁小孩都懂，快去帮我找一个四岁小孩来。我一点头绪都没有。”",
    "date": "2017-12-25 23:08:30"
  },
  {
    "name": "《大众经济学》",
    "rate": "7",
    "writer": "",
    "content": "大众经济学一点儿也不大众，翻译拗口，没法聚心。\n\n从描述一位生活于非洲的小女孩和一位生活于美国的同龄小女孩所处社会中的个人行为准则、家庭、社区、生产组织、市场、政府等各种制度安排的差异着手，来说明一个国家是贫是富，在于一个国家的制度安排是否能够最大程度地调动每个人在工作、学习、积累、创新等方面的积极性。\n\n国民之间的信任程度同样影响着其经济，信任越高，个人、企业相互合作就会增加。\n\n突然发现法律很重要，加入学习清单，明年学习。",
    "date": "2017-12-21 23:43:30"
  },
  {
    "name": "《我们要自学》",
    "rate": "7.5",
    "writer": "",
    "content": "有一股浓浓的知乎味，不过也有收获，让我看到了，仍然有不少人每年保持着50-80本的阅读量。我也得加油跟上。\n对我个人而言，也是好自学的。比如说，我对某技能突然感兴趣了，我一般是先知乎，再根据优质回答收集资料，立习惯每天学习一点。再就是混专门网站和社区，了解大致动态，通常我都是作为一个小透明。最后，直至我对此失去兴趣。这整个过程短则一两天，长则个来月，所以我一直都是半吊子。\n\n记录下你学得的知识和经验，学习方法。再通过演讲、座谈、交流、写作等方式分享出去。最后逐渐形成自己的知识体系。\n\n告诉我的，我会忘记；教给我的，我只能记住；让我参与，我才能学会。——富兰克林",
    "date": "2017-12-19 21:59:25"
  },
  {
    "name": "《好设计不简单》",
    "rate": "5",
    "writer": "",
    "content": "黄金比例作为一种稳定的形状，在银行卡，名片，扑克牌等日常用品都有应用。\n人们会不自觉地看向箭头所指方向。\n\n一些设计考虑要素：留白、间隔、颜色、形状、时间、目标用户、动态效果、点击效果、防误操作、文字、图标、声音、操作习惯、信息反馈、辅助信息、…等等。\n\n最后，这本书有点儿过时也很初级。不推荐",
    "date": "2017-12-17 15:40:06"
  },
  {
    "name": "《必然》",
    "rate": "8",
    "writer": "",
    "content": "在《失控》里KK把机器都拟人化，而在《必然》里新型智能的机器不紧类人，还是外星人般的存在，他们是另外一种异类生物，可实现自我编程。\n在未来，你的薪水高低决定于你能否与机器人的默契配合。好比，二十年前，人们和电脑之间的关系。这里面有个叫机器商的存在。\n\n十二种必然的科技力量，塑造出三十年后的模样。对于未来、人工智能、互联网的看法基本与罗辑思维一致，积极乐观，人类会过得更好。“生活流”记录了我们所有的一切，我们将从一个静态的名词世界前往一个流动的动态世界。\n\n这十二个很唬人的词：\n形成、知化、流动、屏读、获取、共享、\n过滤、重混、互动、追踪、提问、开始。\n它们彼此依存，相互促进，叠加融合，共同构成了一个流动的域。不远的将来，它们会告诉我们往哪个方向前行。",
    "date": "2017-12-16 22:18:31"
  },
  {
    "name": "《程序员的数学》",
    "rate": "8.5",
    "writer": "",
    "content": "中学数学难度，日系书多图，讲解细微，易于理解。所以看技术类书籍比较偏向日系(还不是因为笨)。\n\n知识点：数字0、逻辑两世界、奇偶性、余数、数学归纳法、排列组合、递归、指数对数可数等。\n\n学到的方法：\n在解决大问题时，从小入手，发现规律、性质、结构、一致性等，认清内在模式，再进一步抽象化，实现以小见大。\n画图，更易于理解。",
    "date": "2017-12-11 22:35:58"
  },
  {
    "name": "《图解HTTP》",
    "rate": "9.5",
    "writer": "[日] 上野宣",
    "content": "http中的一些小概念，报文、web、cookie、密钥...带图说明，比较容易理解。HTTP + 加密 + 认证 + 完整性保护 = HTTPS",
    "date": "2017-12-09 17:08:11"
  },
  {
    "name": "《精进：如何成为一个很厉害的人》",
    "rate": "9.5",
    "writer": "采铜",
    "content": "在火车上花了三个多小时看完。方法很多，做或不做都在那里。很喜欢‘铁锤人’这个概念，手里有把铁锤，见什么都是钉子。从自己擅长的事中，寻找高效工作学习的方法。",
    "date": "2017-12-09 15:34:44"
  },
  {
    "name": "《代码的未来》",
    "rate": "9.5",
    "writer": "[日] 松本行弘",
    "content": "起初，是在四川省图书馆看的此书，没看完。当时看到内存管理，GC的三种方法，写得比较好。日本人的书就是通熟易懂。后来年初在豆瓣上买了，可以，对整个编程的一些术语概念都有了更加清晰的认识。",
    "date": "2017-12-09 15:29:10"
  },
  {
    "name": "《浮生六记》",
    "rate": "9",
    "writer": "",
    "content": "浮生若梦为欢几何。\n六记，只残留四篇。最喜《闺房记乐》，小两口忒有趣了。芸，即是贤妻又是闺中良友，有妻如此，夫复何求。怎奈天公薄情，好妇薄命。再观沈三白，游手好闲之感，略带软弱，好酒贪杯。即便是文采书画有所成，也让人爱之不起。",
    "date": "2017-12-09 00:12:55"
  },
  {
    "name": "《黑客与画家》",
    "rate": "7.5",
    "writer": "",
    "content": "虽没达到作者高度，但同属一类人“书呆子”，所以里面很多激进的观点也能理解。本书的有价值部分都在前7章节，关于黑客那群人的普遍价值观、关于通过互联网软件创造财富…",
    "date": "2017-12-05 23:24:56"
  },
  {
    "name": "《上瘾》",
    "rate": "7",
    "writer": "",
    "content": "如果你是位产品经理，推荐此书。\n通过上瘾模型，让你的产品造就用户习惯。近来看的书，很多都展现出了心理学的强大。你要是心理大师，那设计高使用频率的产品自然不在话下。\n另外还有个操控模式，这里存在道德问题。好比《王者荣耀》小学生沉迷。\n了解产品设计背后的心机，可能你就会想：哼，就你这小玩意儿，还想留住我的上瘾心。",
    "imgs": [
      "https://raw.githubusercontent.com/iHongRen/iHongRen.github.io/master/screenshots/reading/IMG_4567.jpeg"
    ],
    "date": "2017-12-01 23:42:08"
  },
  {
    "name": "《代码整洁之道》",
    "rate": "9.5",
    "writer": "",
    "content": "阅完此书，使得代码洁癖越来越严重了。\n从命名、注释、排版、测试、函数、对象、错误处理…等诸多方面进行整改。\n最后一章，味道与启发。作者还给出36条重构清单，并说明了修改原因。",
    "date": "2017-11-29 23:24:27"
  },
  {
    "name": "《人间词话》",
    "rate": "9.5",
    "writer": "",
    "content": "王国维，号人间，是个全才。\n需要一点点文学功底才能读下去，其称呼诗词的作者多是用字、号或世称，如不明是谁，你就抓瞎。\n\n古今之成大事者，必经三种境界：\n1、昨夜西风凋碧树。独上西楼，望尽天涯路。\n2、衣带渐宽终不悔，为伊消得人憔悴。\n3、众里寻他千百度，蓦然回首，那人却在灯火阑珊处。\n\n陈寅恪先生给其评价：独立之精神，自由之思想。这句话很是喜欢，一直作为我微博主页签名。\n\n一年前我就添加了个庄稼“唐诗宋词元曲”，因此收集了一些诗词。对于读此书，起到了一定作用。",
    "date": "2017-11-26 22:04:31"
  },
  {
    "name": "《代码之髓：编程语言核心概念》",
    "rate": "8",
    "writer": "",
    "content": "讲的都是基本概念，难得的是作者给出了一些自己的学习方法。\n1、从需要的地方开始阅读。\n2、先掌握概要再阅读细节。\n3、以上都不奏效时，从头逐章手抄，姑且先做知识的搬运工。\n4、按时间来衡量学习效果，如每隔25分钟看自己学到了多少。\n\n我们在学习一些知识时，为了验证理解正确与否，首先是要表达出来。这点上程序员比较受益，因为有编译器，它会事无巨细的给你检查错误。\n\n另外，如何高效地学习编程语言？\n1、在比较中学习（语言不同，规则不同）\n2、在历史中学习（语言的历史发展）\n3、在实践中学习（亲自进行程序设计）\n\n传说，优秀程序员的三大美德：懒惰、急躁和傲慢。（[ex25]）",
    "date": "2017-11-25 22:04:00"
  },
  {
    "name": "《罗生门》",
    "rate": "8.5",
    "writer": "",
    "content": "短篇小说集，文字有煞气，全是魑魅魍魉，妖魔鬼怪频出没，不推荐乐天派的你看。\n\n惊讶作者对中国历史如此了解，查阅资料得知其游走过小半个中国。\n\n侏儒的话中，语不“神经病”人死不休。句句叫绝。绝到作者本人都想不开，直至结束了自己。",
    "date": "2017-11-23 23:58:24"
  },
  {
    "name": "《联盟》",
    "rate": "8",
    "writer": "",
    "content": "记得罗辑思维里有一期就是讲这本书的内容，雇主与员工的新型关系，当时觉得简直胡扯，看了本书，观念立马改变。\n\n《联盟》建立了一种公司和个人相互投资的工作模式。公司帮助员工改变职业生涯，员工帮助公司改变自身并提高适应力。\n\n诸如领英、脉脉、人人，都提供了联盟平台，在这些平台你可以联系到校友同学、前同事等等。但这些都作为第三方，给公司与员工的关联甚微。\n\n联盟声明样本：\n开场白、任期计划、协调、人脉情报、同事联络网。",
    "date": "2017-11-18 12:19:01"
  },
  {
    "name": "《软件小设计》",
    "rate": "8",
    "writer": "",
    "content": "比较喜欢这个“小”字，很贴切。如今很多流行产品都以它开头起名。\n\n专业上的及时充电必不可少，遇到瓶颈时，进阶之路还是要看书。\n\n本书重点：\n设计 = 元素 + 职责动态分配\n三种元素：变量、函数、对象\n三个步骤：封装、抽象、组合\n三重约束：简短、简单、简洁\n对象设计核心原则：SOLID \n\n这些词的深沉含义得从书中去理解。",
    "date": "2017-11-12 15:49:29"
  },
  {
    "name": "《如何高效阅读》",
    "rate": "8",
    "writer": "",
    "content": "从灯光、坐姿、眼球移动说起，核心方法就是——指读。其中多种手指移动方法。\n\n方法理念：\n- 避免回读\n- 视读，而不是默读\n- 寻找段落主题，组织模式\n- 设定阅读目的\n- 过渡词、信号词、抽象等级\n- 回忆模式图助于记忆理解\n- 无需100%的线性全读\n\nGET：\n1、阅读的最佳灯光是慢射灯。\n2、阅读方法应服务于阅读目的。\n3、书中很多实操练习\n\n改变：\n创建自己的回忆模式图",
    "date": "2017-11-10 22:50:43"
  },
  {
    "name": "《乌合之众》",
    "rate": "9.5",
    "writer": "",
    "content": "本书有很多扎心之论，书很薄，但我划线最多，极力推荐。\n\n大魔王、革命者、演说家、媒体等统治者必读，当然咱们吃瓜群众也得读读。\n\n群体被批得体无完肤。再也不是群众的眼镜是雪亮的了，而是最瞎的。\n\n一定数量的生命体聚在一起，本能的走向奴性，趋向于领袖。不会思考，缺乏批判，易怒轻信，不负责的膨胀。\n\n文明是少数精英的作品。\n\n其中智育和德育篇引用了泰纳先生的《现代政体》，内容相当精彩，虽是一百多年前写的，可感觉就是在说当世的中国啊！例举图中几段：",
    "date": "2017-11-06 23:40:30"
  },
  {
    "name": "《学会提问》",
    "rate": "8.5",
    "writer": "",
    "content": "P118、P140事例很有价值，5W1H疑问词，3V(理想，价值观，常用语)组合。\n\n-没有答案的提问，内化力最强。\n-察言观色获取言外信息\n-优先记下一瞬间想到的提问\n-提问之后，一定要给反馈\n\n-糟糕的提问会扼杀创意\n-面对沉重提问，完成从他责到自责的转变\n-提问改变，行动也会改变\n-再次感到语言的力量\n\n改变：\n-收集自己的常用语\n-养成自问的习惯",
    "date": "2017-10-31 08:33:54"
  },
  {
    "name": "《幸福有方法》",
    "rate": "8",
    "writer": "",
    "content": "我是个实用派，比较喜欢此类直接给出有效方法的书，12种幸福行动有一半是我没做到过的。宗教，敬而远之；冥想，是想还是不想，虚。自助类书籍中，大量的积极心理学不乏精神胜利法之韵，这里并非贬义，只是怀疑真的是这样吗？\n\n收获：\n持久的幸福需要持久的改变。\n人际关系是人类生存最重要的一个构成要素，而我一直是独来独往，缺乏社交技能，容易逃避。\n在家里开辟一个空间，远离各种媒体干扰。\n写作和习惯基本是幸福方法论必备技能。\n\n改变：\n1、将“记录当天美好的事”收入习惯。\n2、感恩是我一直所欠缺的，记得写感恩日记。",
    "date": "2017-10-29 16:47:51"
  },
  {
    "name": "《比从前更好》",
    "rate": "7",
    "writer": "",
    "content": "四种倾向我都有，可能“怀疑者”占比更大些。在二分法的世界里，我是猫头鹰、短跑选手、喜欢简单、终结者、偏好熟悉、预防向导、循序渐进者。\n\n习惯让我们不必为每天选择做什么而烦恼。\n养成好习惯，戒除坏习惯。\n改变习惯的四大策略：监控、基础习惯、日程表、责任感。\n从新努力、新环境、新观点中获取能量：迈出第一步、清零状态、闪电突发事件。\n稳住好习惯的诸多小策略。\n\n成年人结交新朋友更难了。\n直接拒绝一件事比纠结到底要不要做容易得多。\n一个人怎样花费时间，他就会成为怎样的人。（难道不是一运二命三风水…？）\n\n改变：\n开始使用日程表做安排\n创建自己的责任小组",
    "date": "2017-10-27 23:35:14"
  },
  {
    "name": "《搞定Ⅰ》",
    "rate": "5",
    "writer": "",
    "content": "明明可以写成一篇文章，偏偏写成了一本书。看得相当痛苦，从未见过如此啰嗦之人。如果想了解GTD，还是谷歌吧，精炼简洁，说得更清楚。\n而且里面提及的材料、整理术，对IT从业者很不适用，虽然里面借用了很多IT概念，90%都是用不到或从未用过的，不如tower等项目协作工具。我生活简单，一台电脑足够。\n\n当然，也有收获：\n1、两分钟原则\n2、养成“收集”习惯\n3、清理大脑\n4、以及下图\n\n改变：\n做适合自己的个人管理系统，不断收集整理完善。",
    "imgs": [
      "https://raw.githubusercontent.com/iHongRen/iHongRen.github.io/master/screenshots/reading/IMG_4568.jpeg"
    ],
    "date": "2017-10-24 22:47:58"
  },
  {
    "name": "《恰如其分的自尊》",
    "rate": "8",
    "writer": "",
    "content": "这书很适合快速阅读，大量的孩子问题，作为单身狗，我很愉快的跳过去了。\n\n里面提供了相当多的小案例，让我简直认为就是在说我自己。作者还是个表格对比控，当然这样也好对比分析。心理学家、精神分析师都是可怕的存在，在他们面前仿佛被扒得难以见人，我对此类人群心生惧意。\n\n问卷自测结果：中自尊，但急需改变。\n在没看书之前我以后自己是自尊心高的人，然而看下去发现自己属于低自尊。测评结果却给了我中自尊，我是矛盾体啊！\n\n虽说高低自尊各有优缺点，但人类世界更偏爱高自尊，而其更容易成功。掌控好自尊，能高能低，方能游刃有余。\n\n如何看待自己？往下看让自己安心，往上看激励自己。还自己一个恰如其分的形象。\n\n改变：\n不为自尊消费。\n爱自己，爱生活，也爱拉芳。",
    "date": "2017-10-19 22:27:07"
  },
  {
    "name": "《深度工作》",
    "rate": "7",
    "writer": "",
    "content": "深度工作：无干扰状态下专注工作，个人认知能力达到极限，能创造新价值，提升技能，且难以复制。\n输出了网络、社交媒体、电子邮件对人们进入深度工作的影响。干扰造成了我们注意力残留，这些干扰成本又难以计算。\n\n摘抄：\n一个人的日程由内在驱动和在外要求决定。\n重新设计工作，做到心流状态。\n深度的生活并不适合所有人。\n活出专注的人生，是最好的选择。\n\n一些方法：\n1、在特定的时间或地点进行深度任务。（4种哲学、习惯化）\n2、番茄工作法\n3、4原则\n4、工作结束后，彻底屏蔽与工作相关的内容\n5、量化使用网络的时间，减少社交\n6、设置任务截止日期\n7、定量分析每项活动的深度\n8、流程导向法，尽早闭合浮浅任务\n9、降低自身所需的反馈机制\n10、减少对他人的干扰\n\n思考：\n当在电子屏幕上点点点的时候，我们失去了什么？\n如果你的工作百分之百都是浮浅的，该怎么办？\n\n改变：\n删除微博APP，只在电脑端上。\n只把手机作为学习工具，不消遣。\n常用以上方法。提升入静能力。",
    "date": "2017-10-15 12:12:03"
  },
  {
    "name": "《奇特的一生》",
    "rate": "9",
    "writer": "",
    "content": "想必都会问：时间都去哪儿了？\n还得感叹下：苏联人名字可真长啊！\n得不到的永远在骚动，被偏爱的都有恃无恐。当今我们在为空间奋斗着，被其奴役着，而只属于我们的时间却被无情的浪费着。\n\n柳用他奇特的时间统计法记录了五十余载的生活，几乎每一分都计算在内，他早已习惯时间，无需钟表也能准确的估计时间。从简合理的生活，我喜欢如此怪人。我与作者态度基本一致，虽然柳的时间统计法能更明智的使用时间，但我们还是不愿意去尝试，总觉得这么做没意思。\n\n重要：\n半小时也不是少量时间。\n人比信仰重要。\n没有丰功伟绩不重要，过得很好的一生才重要。\n\n改变：\n自创一套属于自己的时间统计法。",
    "date": "2017-10-11 09:22:00"
  },
  {
    "name": "《幸福的方法》",
    "rate": "6",
    "writer": "",
    "content": "书中列出很多“反思”和“练习”都是很难做答且难做到的。\n作者推崇人生的最终目的是幸福，而声望和财富不过是实现幸福的手段，鼓励人们从物质至上到精神至上。\n所谓幸福，乃当下受益，且影响未来，并具备意义和快乐的行为。\n\n心流体验是我们都想要的，工作学习中这会大大提升我们的效率。行为与觉察融为一体，完全沉溺其中，可将我们的表现达到巅峰状态。\n\n思考：\n有没有比幸福更重要的东西？\n怎么去理解日本年轻人的低欲望生活呢？\n\n感悟：\n幸福一词已存储在我的内心，但我还没有拥有它，最多得到过其指针而已。\n我时而虚无、时而享乐、时而忙碌、时而感悟。相信很多人都如我这般，不同阶段有着不同的主义类型。\n\n改变：\n以前我是把寻找相爱伴侣作为人生目标，现在我发现这远远不够，以后的幸福生活才更该去关注。",
    "date": "2017-10-07 22:04:16"
  },
  {
    "name": "《六顶思考帽》",
    "rate": "8",
    "writer": "",
    "content": "六顶帽：\n蓝帽（流程控制）\n白帽（数据说话）\n红帽（情感直觉）\n黄帽（积极正面）\n黑帽（槽点弊端）\n绿帽（创造破局）\n\n摘抄：\n1、不要对自己设框架，那样你会不想出来。\n2、让人们“参与游戏”是改变行为的一种高效方式。\n3、提问是最简单的专注思考的方式。\n帽子更换衔接犹如开车换挡一样自然。\n4、可变价值是谈判的基础。\n5、没有某种成就感和价值感，人很难做成某事。\n6、接受存在不同视角的事实。\n7、思考帽的两个目的：一、每次只处理一件事，简化思考过程。二、在思考过程中可以进行切换。\n8、IBM提供的700万份文件，足以熬死几代法官，使其诉讼变为不可审理案件。手法高明，学到了。\n\n想法：\n1、能否做一个可使用六顶帽子软件，方便人们解决问题。\n\n改变：\n1、深刻的意识到我一直都是黑帽专业户，只会瞎吐槽。以后对人遇事还是得多带小黄帽。\n2、将六顶思考帽方法作为一种习惯，带入生活中检验其效果。",
    "date": "2017-10-04 12:52:27"
  },
  {
    "name": "《生命向前》",
    "rate": "5",
    "writer": "",
    "content": "现实的路有GPS，人生的路得靠提前规划。\n无意义的漂流，我是个“成漂”。但我没认清，我最怕的是原处沉浮。\n\n三个有力的问题，将功利心推到极点，虽略有反感，还是不得不承认这很实在。\n（1）我希望自己如何被他人记得？\n（2）什么最重要？\n（3）我怎样才能从当下到达我的目的？\n\n人生账户，以自己为中心，外附“存在”、“关系”、“事业”三个同心圆。进行各个领域账号情况分析，余额评估，接着就是做行动计划，提升盈余。\n\n前面各界推荐多是此类书籍的作家，很大程度上的相互抬高。\n这就是一本“冠军联盟”培训机构的广告宣传书。\n\n想法：\n1、如何另辟蹊径做一个既能赚钱，又不误人子弟，还能升华他人的“X联盟”呢？\n2、衡量机会成本的这段时间成本算谁的？\n\n改变：\n学会“是-不-是”这种优雅的断然说“不”。",
    "date": "2017-09-27 00:41:25"
  },
  {
    "name": "《如何有效阅读一本书》",
    "rate": "7",
    "writer": "",
    "content": "有时重(zhòng)读，有时重(chóng)读\n文中小标题既重又重读\n笔记用不同符号来区分\n一味地盲读等于没读过\n读书体验比书本更重要\n记录下闪现的奇思妙想\n\n读书搭上思想便车，笔记是思想的仓库\n评论作为原创思考不分正确与否，都记下来\n出门时有没有一本你很想带在身边的书？\n\n改变：\n整理自己的书评、影评到Blog里，以后会起到坚实的心理支撑作用",
    "date": "2017-09-21 23:15:17"
  },
  {
    "name": "《快速阅读术》",
    "rate": "7",
    "writer": "",
    "content": "你是被仔细阅读拖慢了速度。\n为写而读，不是为记而读。\n流水式而非存储式阅读。\n养成定时定点的阅读习惯。\n小标题、目录有助于跳读。\n关键字搜索式换挡读。\n书摘：一行采集、一行精华、一行评论。\n整理看过的书，不是好评的书没必要留着了。\n\n看了以上几条基本能回忆起本书内容了。\n\n改变：对于送书不会纠结了。",
    "date": "2017-09-19 23:07:27"
  },
  {
    "name": "《时间管理》",
    "rate": "",
    "writer": "",
    "content": "意识，是时间管理的先决条件。\n目标，提供线路图。\n选择，是难点。\n\n意识到自己对时间的感觉，可以使你更了解自己。",
    "date": "2017-09-05 09:33:39"
  }
]